# ultralytics YOLOv8.0.0 P2-head modification
# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# Backbone (remains the same as yolov8s.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]   # 9

# Head (THIS IS THE MODIFIED PART)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # concat backbone P4
  - [-1, 3, C2f, [512, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # concat backbone P3
  - [-1, 3, C2f, [256, False]] # 15 (P3/8-small)

  # --- P2 HEAD ADDITION ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]] # concat backbone P2
  - [-1, 3, C2f, [128, False]] # 18 (P2/4-tiny)

  # --- DOWN-SAMPLING PATH ---
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # concat head P3
  - [-1, 3, C2f, [256, False]] # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # concat head P4
  - [-1, 3, C2f, [512, False]] # 24 (P4/16-medium)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P2, P3, P4)
